---
kind: method
id: M:Autodesk.Revit.DB.FaceEdgeNode.GetFaceEdge
source: html/dfa4e418-11e4-466d-d48b-938f31aa678c.htm
---
# Autodesk.Revit.DB.FaceEdgeNode.GetFaceEdge Method

Returns the Face edge object corresponding to the node.

## Syntax (C#)
```csharp
public Edge GetFaceEdge()
```

## Returns
The face edge.